```
krishna@turbotindias-MacBook-Pro gcp_check_logging % terraform apply --var-file=demo.tfvars
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.gcp_instance_binary_log[0] will be created
  + resource "turbot_policy_setting" "gcp_instance_binary_log" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/binaryLogEnabled"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_kubernetes_engine_region_cluster_logging[0] will be created
  + resource "turbot_policy_setting" "gcp_kubernetes_engine_region_cluster_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kubernetesengine#/policy/types/regionClusterLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_network_backend_service_logging will be created
  + resource "turbot_policy_setting" "gcp_network_backend_service_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/backendServiceLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_network_backend_service_logging_sammple_rate will be created
  + resource "turbot_policy_setting" "gcp_network_backend_service_logging_sammple_rate" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/backendServiceLoggingSampleRate"
      + value                        = "1"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_network_firewall_logging will be created
  + resource "turbot_policy_setting" "gcp_network_firewall_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/firewallLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_network_region_backend_service_logging[0] will be created
  + resource "turbot_policy_setting" "gcp_network_region_backend_service_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/regionBackendServiceLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_network_region_backend_service_logging_sammple_rate[0] will be created
  + resource "turbot_policy_setting" "gcp_network_region_backend_service_logging_sammple_rate" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/regionBackendServiceLoggingSampleRate"
      + value                        = "1"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.gcp_logging will be created
  + resource "turbot_smart_folder" "gcp_logging" {
      + description = "Defines sets of policies for the Azure check logging baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "Azure Check Logging Policies"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.gcp_logging: Creating...
turbot_smart_folder.gcp_logging: Creation complete after 2s [id=216678789878653]
turbot_policy_setting.gcp_instance_binary_log[0]: Creating...
turbot_policy_setting.gcp_network_backend_service_logging_sammple_rate: Creating...
turbot_policy_setting.gcp_network_region_backend_service_logging[0]: Creating...
turbot_policy_setting.gcp_network_region_backend_service_logging_sammple_rate[0]: Creating...
turbot_policy_setting.gcp_network_backend_service_logging: Creating...
turbot_policy_setting.gcp_network_firewall_logging: Creating...
turbot_policy_setting.gcp_kubernetes_engine_region_cluster_logging[0]: Creating...
turbot_policy_setting.gcp_network_backend_service_logging: Creation complete after 3s [id=216678793136007]
turbot_policy_setting.gcp_instance_binary_log[0]: Creation complete after 3s [id=216678793246614]
turbot_policy_setting.gcp_kubernetes_engine_region_cluster_logging[0]: Creation complete after 4s [id=216678793148297]
turbot_policy_setting.gcp_network_firewall_logging: Creation complete after 4s [id=216678793145224]
turbot_policy_setting.gcp_network_region_backend_service_logging[0]: Creation complete after 4s [id=216678793130886]
turbot_policy_setting.gcp_network_backend_service_logging_sammple_rate: Creation complete after 4s [id=216678794088347]
turbot_policy_setting.gcp_network_region_backend_service_logging_sammple_rate[0]: Creation complete after 4s [id=216678794188704]

Apply complete! Resources: 8 added, 0 changed, 0 destroyed.

Outputs:

enable_instance_binary_log_policies = true
enable_kubernetes_engine_region_cluster_logging_policies = true
enable_network_region_backend_service_logging_policies = true
enable_network_region_backend_service_logging_sammple_rate_policies = true
smart_folder_description = Defines sets of policies for the Azure check logging baseline
smart_folder_name = Azure Check Logging Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher